Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/include/proc/p32mz2025dal176.h
extern volatile __ANSELCbits_t ANSELCbits __asm__ ("ANSELC") __attribute__((section("sfrs"), address(0xBF860200)));
extern volatile uint32_t        ANSELCCLR __attribute__((section("sfrs"),address(0xBF860204)));
extern volatile uint32_t        ANSELCSET __attribute__((section("sfrs"),address(0xBF860208)));
extern volatile uint32_t        ANSELCINV __attribute__((section("sfrs"),address(0xBF86020C)));
#define TRISC TRISC
extern volatile uint32_t   TRISC __attribute__((section("sfrs"), address(0xBF860210)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t TRISC1:1;
    uint32_t TRISC2:1;
    uint32_t TRISC3:1;
    uint32_t TRISC4:1;
    uint32_t :7;
    uint32_t TRISC12:1;
    uint32_t TRISC13:1;
    uint32_t TRISC14:1;
    uint32_t TRISC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISCbits_t;
extern volatile __TRISCbits_t TRISCbits __asm__ ("TRISC") __attribute__((section("sfrs"), address(0xBF860210)));
extern volatile uint32_t        TRISCCLR __attribute__((section("sfrs"),address(0xBF860214)));
extern volatile uint32_t        TRISCSET __attribute__((section("sfrs"),address(0xBF860218)));
extern volatile uint32_t        TRISCINV __attribute__((section("sfrs"),address(0xBF86021C)));
#define PORTC PORTC
extern volatile uint32_t   PORTC __attribute__((section("sfrs"), address(0xBF860220)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t RC1:1;
    uint32_t RC2:1;
    uint32_t RC3:1;
    uint32_t RC4:1;
    uint32_t :7;
    uint32_t RC12:1;
    uint32_t RC13:1;
    uint32_t RC14:1;
    uint32_t RC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTCbits_t;
extern volatile __PORTCbits_t PORTCbits __asm__ ("PORTC") __attribute__((section("sfrs"), address(0xBF860220)));
extern volatile uint32_t        PORTCCLR __attribute__((section("sfrs"),address(0xBF860224)));
extern volatile uint32_t        PORTCSET __attribute__((section("sfrs"),address(0xBF860228)));
extern volatile uint32_t        PORTCINV __attribute__((section("sfrs"),address(0xBF86022C)));
#define LATC LATC
extern volatile uint32_t   LATC __attribute__((section("sfrs"), address(0xBF860230)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t LATC1:1;
    uint32_t LATC2:1;
    uint32_t LATC3:1;
    uint32_t LATC4:1;
    uint32_t :7;
    uint32_t LATC12:1;
    uint32_t LATC13:1;
    uint32_t LATC14:1;
    uint32_t LATC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATCbits_t;
extern volatile __LATCbits_t LATCbits __asm__ ("LATC") __attribute__((section("sfrs"), address(0xBF860230)));
extern volatile uint32_t        LATCCLR __attribute__((section("sfrs"),address(0xBF860234)));
extern volatile uint32_t        LATCSET __attribute__((section("sfrs"),address(0xBF860238)));
extern volatile uint32_t        LATCINV __attribute__((section("sfrs"),address(0xBF86023C)));
#define ODCC ODCC
extern volatile uint32_t   ODCC __attribute__((section("sfrs"), address(0xBF860240)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t ODCC1:1;
    uint32_t ODCC2:1;
    uint32_t ODCC3:1;
    uint32_t ODCC4:1;
    uint32_t :7;
    uint32_t ODCC12:1;
    uint32_t ODCC13:1;
    uint32_t ODCC14:1;
    uint32_t ODCC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCCbits_t;
extern volatile __ODCCbits_t ODCCbits __asm__ ("ODCC") __attribute__((section("sfrs"), address(0xBF860240)));
extern volatile uint32_t        ODCCCLR __attribute__((section("sfrs"),address(0xBF860244)));
extern volatile uint32_t        ODCCSET __attribute__((section("sfrs"),address(0xBF860248)));
extern volatile uint32_t        ODCCINV __attribute__((section("sfrs"),address(0xBF86024C)));
#define CNPUC CNPUC
extern volatile uint32_t   CNPUC __attribute__((section("sfrs"), address(0xBF860250)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t CNPUC1:1;
    uint32_t CNPUC2:1;
    uint32_t CNPUC3:1;
    uint32_t CNPUC4:1;
    uint32_t :7;
    uint32_t CNPUC12:1;
    uint32_t CNPUC13:1;
    uint32_t CNPUC14:1;
    uint32_t CNPUC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUCbits_t;
extern volatile __CNPUCbits_t CNPUCbits __asm__ ("CNPUC") __attribute__((section("sfrs"), address(0xBF860250)));
extern volatile uint32_t        CNPUCCLR __attribute__((section("sfrs"),address(0xBF860254)));
extern volatile uint32_t        CNPUCSET __attribute__((section("sfrs"),address(0xBF860258)));
extern volatile uint32_t        CNPUCINV __attribute__((section("sfrs"),address(0xBF86025C)));
#define CNPDC CNPDC
extern volatile uint32_t   CNPDC __attribute__((section("sfrs"), address(0xBF860260)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t CNPDC1:1;
    uint32_t CNPDC2:1;
    uint32_t CNPDC3:1;
    uint32_t CNPDC4:1;
    uint32_t :7;
    uint32_t CNPDC12:1;
    uint32_t CNPDC13:1;
    uint32_t CNPDC14:1;
    uint32_t CNPDC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDCbits_t;
extern volatile __CNPDCbits_t CNPDCbits __asm__ ("CNPDC") __attribute__((section("sfrs"), address(0xBF860260)));
extern volatile uint32_t        CNPDCCLR __attribute__((section("sfrs"),address(0xBF860264)));
extern volatile uint32_t        CNPDCSET __attribute__((section("sfrs"),address(0xBF860268)));
extern volatile uint32_t        CNPDCINV __attribute__((section("sfrs"),address(0xBF86026C)));
#define CNCONC CNCONC
extern volatile uint32_t   CNCONC __attribute__((section("sfrs"), address(0xBF860270)));
typedef union {
  struct {
    uint32_t :11;
    uint32_t EDGEDETECT:1;
    uint32_t :3;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONCbits_t;
extern volatile __CNCONCbits_t CNCONCbits __asm__ ("CNCONC") __attribute__((section("sfrs"), address(0xBF860270)));
extern volatile uint32_t        CNCONCCLR __attribute__((section("sfrs"),address(0xBF860274)));
extern volatile uint32_t        CNCONCSET __attribute__((section("sfrs"),address(0xBF860278)));
extern volatile uint32_t        CNCONCINV __attribute__((section("sfrs"),address(0xBF86027C)));
#define CNENC CNENC
extern volatile uint32_t   CNENC __attribute__((section("sfrs"), address(0xBF860280)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t CNIEC1:1;
    uint32_t CNIEC2:1;
    uint32_t CNIEC3:1;
    uint32_t CNIEC4:1;
    uint32_t :7;
    uint32_t CNIEC12:1;
    uint32_t CNIEC13:1;
    uint32_t CNIEC14:1;
    uint32_t CNIEC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENCbits_t;
extern volatile __CNENCbits_t CNENCbits __asm__ ("CNENC") __attribute__((section("sfrs"), address(0xBF860280)));
extern volatile uint32_t        CNENCCLR __attribute__((section("sfrs"),address(0xBF860284)));
extern volatile uint32_t        CNENCSET __attribute__((section("sfrs"),address(0xBF860288)));
extern volatile uint32_t        CNENCINV __attribute__((section("sfrs"),address(0xBF86028C)));
#define CNSTATC CNSTATC
extern volatile uint32_t   CNSTATC __attribute__((section("sfrs"), address(0xBF860290)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t CNSTATC1:1;
    uint32_t CNSTATC2:1;
    uint32_t CNSTATC3:1;
    uint32_t CNSTATC4:1;
    uint32_t :7;
    uint32_t CNSTATC12:1;
    uint32_t CNSTATC13:1;
    uint32_t CNSTATC14:1;
    uint32_t CNSTATC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATCbits_t;
