Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/include/proc/p32mz2025dal176.h
/* Base Addresses for Peripherals */
#define _ADCHS_BASE_ADDRESS                      0xBF84B000
#define _CAN1_BASE_ADDRESS                       0xBF880000
#define _CAN2_BASE_ADDRESS                       0xBF881000
#define _CFG_BASE_ADDRESS                        0xBF800000
#define _CMP1_BASE_ADDRESS                       0xBF84C000
#define _CMP2_BASE_ADDRESS                       0xBF84C010
#define _CMP_BASE_ADDRESS                        0xBF84C000
#define _CRU_BASE_ADDRESS                        0xBF801200
#define _CRYPTO_BASE_ADDRESS                     0xBF8E5000
#define _CTMU_BASE_ADDRESS                       0xBF84C200
#define _CVR_BASE_ADDRESS                        0xBF800E00
#define _DMAC_BASE_ADDRESS                       0xBF811000
#define _DMT_BASE_ADDRESS                        0xBF800A00
#define _EBI_BASE_ADDRESS                        0xBF8E1014
#define _ETH_BASE_ADDRESS                        0xBF882000
#define _GLCD_BASE_ADDRESS                       0xBF8EA000
#define _GPU_BASE_ADDRESS                        0xBF8EB000
#define _HLVD_BASE_ADDRESS                       0xBF801800
#define _I2C1_BASE_ADDRESS                       0xBF820000
#define _I2C2_BASE_ADDRESS                       0xBF820200
#define _I2C3_BASE_ADDRESS                       0xBF820400
#define _I2C4_BASE_ADDRESS                       0xBF820600
#define _I2C5_BASE_ADDRESS                       0xBF820800
#define _ICAP1_BASE_ADDRESS                      0xBF842000
#define _ICAP2_BASE_ADDRESS                      0xBF842200
#define _ICAP3_BASE_ADDRESS                      0xBF842400
#define _ICAP4_BASE_ADDRESS                      0xBF842600
#define _ICAP5_BASE_ADDRESS                      0xBF842800
#define _ICAP6_BASE_ADDRESS                      0xBF842A00
#define _ICAP7_BASE_ADDRESS                      0xBF842C00
#define _ICAP8_BASE_ADDRESS                      0xBF842E00
#define _ICAP9_BASE_ADDRESS                      0xBF843000
#define _INT_BASE_ADDRESS                        0xBF810000
#define _NVM_BASE_ADDRESS                        0xBF800600
#define _OCMP1_BASE_ADDRESS                      0xBF844000
#define _OCMP2_BASE_ADDRESS                      0xBF844200
#define _OCMP3_BASE_ADDRESS                      0xBF844400
#define _OCMP4_BASE_ADDRESS                      0xBF844600
#define _OCMP5_BASE_ADDRESS                      0xBF844800
#define _OCMP6_BASE_ADDRESS                      0xBF844A00
#define _OCMP7_BASE_ADDRESS                      0xBF844C00
#define _OCMP8_BASE_ADDRESS                      0xBF844E00
#define _OCMP9_BASE_ADDRESS                      0xBF845000
#define _PCACHE_BASE_ADDRESS                     0xBF8E0000
#define _PMP_BASE_ADDRESS                        0xBF82E000
#define _PORTA_BASE_ADDRESS                      0xBF860020
#define _PORTB_BASE_ADDRESS                      0xBF860120
#define _PORTC_BASE_ADDRESS                      0xBF860220
#define _PORTD_BASE_ADDRESS                      0xBF860320
#define _PORTE_BASE_ADDRESS                      0xBF860420
#define _PORTF_BASE_ADDRESS                      0xBF860520
#define _PORTG_BASE_ADDRESS                      0xBF860620
#define _PORTH_BASE_ADDRESS                      0xBF860720
#define _PORTJ_BASE_ADDRESS                      0xBF860820
#define _PORTK_BASE_ADDRESS                      0xBF860920
#define _RNG_BASE_ADDRESS                        0xBF8E6000
#define _RTCC_BASE_ADDRESS                       0xBF8C0000
#define _SB_BASE_ADDRESS                         0xBF920510
#define _SDHC_BASE_ADDRESS                       0xBF8EC004
#define _SPI1_BASE_ADDRESS                       0xBF821000
#define _SPI2_BASE_ADDRESS                       0xBF821200
#define _SPI3_BASE_ADDRESS                       0xBF821400
#define _SPI4_BASE_ADDRESS                       0xBF821600
#define _SPI5_BASE_ADDRESS                       0xBF821800
#define _SPI6_BASE_ADDRESS                       0xBF821A00
#define _SQI1_BASE_ADDRESS                       0xBF8E2000
#define _TMR1_BASE_ADDRESS                       0xBF840000
#define _TMR23_BASE_ADDRESS                      0xBF840200
#define _TMR2_BASE_ADDRESS                       0xBF840200
#define _TMR3_BASE_ADDRESS                       0xBF840400
#define _TMR45_BASE_ADDRESS                      0xBF840600
#define _TMR4_BASE_ADDRESS                       0xBF840600
#define _TMR5_BASE_ADDRESS                       0xBF840800
#define _TMR67_BASE_ADDRESS                      0xBF840A00
#define _TMR6_BASE_ADDRESS                       0xBF840A00
#define _TMR7_BASE_ADDRESS                       0xBF840C00
#define _TMR89_BASE_ADDRESS                      0xBF840E00
#define _TMR8_BASE_ADDRESS                       0xBF840E00
#define _TMR9_BASE_ADDRESS                       0xBF841000
#define _UART1_BASE_ADDRESS                      0xBF822000
#define _UART2_BASE_ADDRESS                      0xBF822200
#define _UART3_BASE_ADDRESS                      0xBF822400
#define _UART4_BASE_ADDRESS                      0xBF822600
#define _UART5_BASE_ADDRESS                      0xBF822800
#define _UART6_BASE_ADDRESS                      0xBF822A00
#define _UARTAB_BASE_ADDRESS                     0xBF822000
#define _UARTCD_BASE_ADDRESS                     0xBF822200
#define _UARTEF_BASE_ADDRESS                     0xBF822400
#define _UARTGH_BASE_ADDRESS                     0xBF822600
#define _UARTJK_BASE_ADDRESS                     0xBF822800
#define _UARTLM_BASE_ADDRESS                     0xBF822A00
#define _USB_BASE_ADDRESS                        0xBF8E3000
#define _WDT_BASE_ADDRESS                        0xBF800800
#define __DDPSTAT_BASE_ADDRESS                   0xBF801140

/* Default Memory-region macros */
#define __BOOT2LASTPAGE_BASE                     0xBFC70000
#define __BOOT2LASTPAGE_LENGTH                   0x4000
#define __KSEG1_BOOT_MEM_BASE                    0xBFC00000
#define __KSEG1_BOOT_MEM_LENGTH                  0x480
#define __KSEG1_BOOT_MEM_4B0_BASE                0xBFC004B0
#define __KSEG1_BOOT_MEM_4B0_LENGTH              0xFA50
#define __BOOT1LASTPAGE_BASE                     0xBFC50000
#define __BOOT1LASTPAGE_LENGTH                   0x4000
#define __UPPERBOOTALIASLASTPAGE_BASE            0xBFC30000
#define __UPPERBOOTALIASLASTPAGE_LENGTH          0x4000
#define __BOOT1_BASE                             0xBFC40000
#define __BOOT1_LENGTH                           0xFF00
#define __BOOT2_BASE                             0xBFC60000
#define __BOOT2_LENGTH                           0xFF00
#define __LOWERBOOTALIASLASTPAGE_BASE            0xBFC10000
#define __LOWERBOOTALIASLASTPAGE_LENGTH          0x4000
#define __UPPERBOOTALIAS_BASE                    0xBFC20000
#define __UPPERBOOTALIAS_LENGTH                  0xFF00
#define __KSEG0_PROGRAM_MEM_BASE                 0x9D000000
#define __KSEG0_PROGRAM_MEM_LENGTH               0x200000
#define __KSEG0_DATA_MEM_BASE                    0x80000000
#define __KSEG0_DATA_MEM_LENGTH                  0x40000
#define __CONFIGSFRS_BFC0FFB0_BASE               0xBFC0FFB0
#define __CONFIGSFRS_BFC0FFB0_LENGTH             0x44
#define __CONFIGSFRS_BFC54000_BASE               0xBFC54000
#define __CONFIGSFRS_BFC54000_LENGTH             0x28
#define __CONFIGSFRS_BFC4FFB0_BASE               0xBFC4FFB0
#define __CONFIGSFRS_BFC4FFB0_LENGTH             0x44
#define __CONFIGSFRS_BFC4FF30_BASE               0xBFC4FF30
#define __CONFIGSFRS_BFC4FF30_LENGTH             0x44
#define __CONFIGSFRS_BFC0FF30_BASE               0xBFC0FF30
#define __CONFIGSFRS_BFC0FF30_LENGTH             0x44
#define __CONFIGSFRS_BFC2FFB0_BASE               0xBFC2FFB0
#define __CONFIGSFRS_BFC2FFB0_LENGTH             0x44
#define __CONFIGSFRS_BFC6FFB0_BASE               0xBFC6FFB0
#define __CONFIGSFRS_BFC6FFB0_LENGTH             0x44
#define __CONFIGSFRS_BFC2FF30_BASE               0xBFC2FF30
#define __CONFIGSFRS_BFC2FF30_LENGTH             0x44
#define __CONFIGSFRS_BFC6FF30_BASE               0xBFC6FF30
#define __CONFIGSFRS_BFC6FF30_LENGTH             0x44
#define __KSEG2_SQI_DATA_MEM_BASE                0xD0000000
#define __KSEG2_SQI_DATA_MEM_LENGTH              0x4000000
#define __KSEG3_SQI_DATA_MEM_BASE                0xF0000000
#define __KSEG3_SQI_DATA_MEM_LENGTH              0x4000000
#define __KSEG2_EBI_DATA_MEM_BASE                0xC0000000
#define __KSEG2_EBI_DATA_MEM_LENGTH              0x4000000
#define __KSEG3_EBI_DATA_MEM_BASE                0xE0000000
#define __KSEG3_EBI_DATA_MEM_LENGTH              0x4000000
#define __SFRS_BASE                              0xBF800000
#define __SFRS_LENGTH                            0x100000

